{
  "company": "KiWi Power Ltd.",
  "subtitle": "Worked with KiWi Power for 2 years in a variety of roles as the company grew to be a world leader in Demand Response",
  "jobs": [
    {
      "jobTitle": "Head of Hardware Solutions",
      "dates": "(01/2019 – 04/2019)",
      "lines": [
        "Led a team supporting the work of the Technology, Sales, Installation and Operational teams to solve Hardware challenges.",
        "Our work involved acting as 'subject matter experts' for our hardware, business systems and 3rd party integrations.",
        "Led the certification process for our IoT Energy Management Product 'Fruit' to achieve UL2900-2-2 and UL Safety Certification",
        "Onboarding of new manufacturers. Ran the hiring process in the Firmware team",
        "Engagement with external partners to assist in the technical analysis of new business opportunities."
      ]
    },
    {
      "jobTitle": "Product Owner",
      "dates": "(01/2018 – 04/2019)",
      "lines": [
        "Ownership of all legacy and new Internet of Things hardware, guiding the firmware team, developing specifications with business owners and managing feature priorities.",
        "Also wrote TDD code for bug fixing and small features in the ‘Electric Imp platform’ language Squirrel and companion testing framework ‘Nutkin’.",
        "Role involved Agile management, documentation, business analysis using MySQL and Python, basic Android app development, physical hardware builds, policy engagement and lobbying, testing, prototyping and competitor research."
      ]
    },
    {
      "jobTitle": "Support/QA Engineer",
      "dates": "(01/2017 – 01/2019)",
      "lines": [
        "My role was to own the resolution of operational problems, support product development and solve unique project challenges.",
        "QA tasks: Bug diagnostics in our hardware and web services, automation of manual team tasks and ensuring commissioning best practice.",
        "Support tasks: sourcing and testing equipment, automated testing maintenance and code level bug analysis in C & Squirrel.",
        "Also supported various one-off projects such as an ‘SQL/Influx to modbus to voltages’ interface built with a RaspberryPi and NodeRed."
      ]
    }
  ],
  "links": {
    "Company Website": "https://www.kiwipowered.com/"
  },
  "pictures": [
    "https://assets.website-files.com/5db6b0c319de554d7df11205/5dbb07e58287ba1de23efa74_Kiwi_logo_a.svg",
    "https://media-exp1.licdn.com/media-proxy/ext?w=1024&h=1024&f=n&hash=S8rWl%2FM%2FGIEvRmRUUmfXzwRWK6k%3D&ora=1%2CaFBCTXdkRmpGL2lvQUFBPQ%2CxAVta5g-0R6jnhodx1Ey9KGTqAGj6E5DQJHUA3L0CHH05IbfPWi9ccOLK7ukrUARKytTjQBneue1SGThQ47uLY_tLNwnisThcMX5agYUbhl4j3lK6w",
    "https://media-exp1.licdn.com/media-proxy/ext?w=1024&h=770&f=n&hash=f8Lrc1pGXes7kJvbG8p2m2xPNeI%3D&ora=1%2CaFBCTXdkRmpGL2lvQUFBPQ%2CxAVta5g-0R6jnhodx1Ey9KGTqAGj6E5DQJHUA3L0CHH05IbfPWi6K8fYfLam8EAVfCkDjQBgLu-1STTnEY65ed_mL9sniJbtcpT5agYUbhl4j3lK6w"
  ]
}
